{"NASA Invites Public to Share Excitement of Mars 2020 Perseverance Rover Launch":{"0":"There are lots of ways to participate in the historic event, which is targeted for July 30."},"The MarCO Mission Comes to an End":{"0":"The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."},"NASA's Mars Rover Drivers Need Your Help":{"0":"Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."},"Two of a Space Kind: Apollo 12 and Mars 2020":{"0":"Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."},"With Mars Methane Mystery Unsolved, Curiosity Serves Scientists a New One: Oxygen":{"0":"For the first time in the history of space exploration, scientists have measured the seasonal changes in the gases that fill the air directly above the surface of Gale Crater on Mars. "},"New Selfie Shows Curiosity, the Mars Chemist":{"0":"The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."},"NASA's InSight 'Hears' Peculiar Sounds on Mars":{"0":"Listen to the marsquakes and other, less-expected sounds that the Mars lander has been detecting."},"NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound":{"0":"The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."},"NASA Invites Students to Name Mars 2020 Rover":{"0":"Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."},"NASA's Perseverance Mars Rover Gets Balanced":{"0":"The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."},"NASA Adds Return Sample Scientists to Mars 2020 Leadership Team":{"0":"The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."},"Two Rovers to Roll on Mars Again: Curiosity and Mars 2020":{"0":"They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."},"NASA's MAVEN Explores Mars to Understand Radio Interference at Earth":{"0":"NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."},"MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss":{"0":"Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."},"5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover":{"0":"The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."}}